test-magazine-new.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-04-09 Thu 16:46 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Life Operating System 2024</title>
<meta name="author" content="Your Name" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/magazine_theme/css/magazine.css"/>
<link rel="stylesheet" href="https://fonts.googleapis.com/css2?family=Playfair+Display:wght@400;500;600;700&family=Inter:wght@300;400;500;600&family=JetBrains+Mono:wght@400;500&display=swap"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Life Operating System 2024</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org26e4ba8">1. 📅 Daily Dashboard</a></li>
<li><a href="#orgdbf771d">2. 🛠️ Active Projects</a>
<ul>
<li><a href="#org6602e97">2.1. Project: Website Redesign&#xa0;&#xa0;&#xa0;<span class="tag"><span class="WORK">WORK</span>&#xa0;<span class="PROJECT">PROJECT</span></span></a></li>
<li><a href="#org5bfc73b">2.2. Project: Learn Emacs Lisp&#xa0;&#xa0;&#xa0;<span class="tag"><span class="STUDY">STUDY</span></span></a></li>
</ul>
</li>
<li><a href="#orgad058d9">3. 📚 Knowledge Base (Zettelkasten)</a>
<ul>
<li><a href="#orgcf1cffd">3.1. 🧠 Cognitive Science</a></li>
<li><a href="#org2e4c34c">3.2. 💻 Programming Tips</a></li>
</ul>
</li>
<li><a href="#org2d0aa7c">4. 🛒 Shopping &amp; Errands</a></li>
<li><a href="#orgad3e93f">5. 🗓️ Calendar &amp; Deadlines</a></li>
<li><a href="#org1ceca35">6. 📥 Inbox / Scratchpad</a></li>
</ul>
</div>
</div>
<div id="outline-container-org26e4ba8" class="outline-2">
<h2 id="org26e4ba8"><span class="section-number-2">1.</span> 📅 Daily Dashboard</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Check emails                                    # Morning routine</li>
<li class="off"><code>[&#xa0;]</code> Review today's calendar                        # Morning routine</li>
<li class="off"><code>[&#xa0;]</code> Drink 2L of water                              # Health</li>
<li class="off"><code>[&#xa0;]</code> Meditate for 10 mins                          # Mindset</li>
</ul>

<p>
** ☀️ Morning Journal
</p>
<ul class="org-ul">
<li><b>Mood:</b> Energized</li>
<li><b>Focus for today:</b> Complete the project proposal.</li>
<li><b>Gratitude:</b> I am grateful for a fast computer and coffee.</li>
</ul>
</div>
</div>
<div id="outline-container-orgdbf771d" class="outline-2">
<h2 id="orgdbf771d"><span class="section-number-2">2.</span> 🛠️ Active Projects</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6602e97" class="outline-3">
<h3 id="org6602e97"><span class="section-number-3">2.1.</span> Project: Website Redesign&#xa0;&#xa0;&#xa0;<span class="tag"><span class="WORK">WORK</span>&#xa0;<span class="PROJECT">PROJECT</span></span></h3>
<div class="outline-text-3" id="text-2-1">
<p>
DEADLINE: <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-06-01 Sat&gt;</span></span>
Effort: 20h
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> Research competitors</li>
<li class="off"><code>[&#xa0;]</code> Create wireframes
<ul class="org-ul">
<li><i>Note: Focus on mobile-first design</i></li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Client feedback loop</li>
<li class="off"><code>[&#xa0;]</code> Final deployment</li>
</ul>

<blockquote>
<p>
"Design is not just what it looks like and feels like. Design is how it works." — Steve Jobs
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org5bfc73b" class="outline-3">
<h3 id="org5bfc73b"><span class="section-number-3">2.2.</span> Project: Learn Emacs Lisp&#xa0;&#xa0;&#xa0;<span class="tag"><span class="STUDY">STUDY</span></span></h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Read "An Introduction to Programming in Emacs Lisp"</li>
<li class="off"><code>[&#xa0;]</code> Build a custom Org-mode capture template</li>
<li class="off"><code>[&#xa0;]</code> Understand hooks and buffers</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgad058d9" class="outline-2">
<h2 id="orgad058d9"><span class="section-number-2">3.</span> 📚 Knowledge Base (Zettelkasten)</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgcf1cffd" class="outline-3">
<h3 id="orgcf1cffd"><span class="section-number-3">3.1.</span> 🧠 Cognitive Science</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><b>Spaced Repetition:</b> The technique of increasing intervals between reviews.</li>
<li><b>Active Recall:</b> Testing yourself rather than re-reading.</li>
<li><a href="https://wikipedia.org/wiki/Learning">Link to Wiki</a></li>
</ul>
</div>
</div>
<div id="outline-container-org2e4c34c" class="outline-3">
<h3 id="org2e4c34c"><span class="section-number-3">3.2.</span> 💻 Programming Tips</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<b>*</b> Python List Comprehensions
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #d55e00; font-style: italic;"># </span><span style="color: #d55e00; font-style: italic;">This is a sample code block
</span><span style="color: #00ff00;">numbers</span> = [1, 2, 3, 4, 5]
<span style="color: #00ff00;">squares</span> = [n**2 <span style="color: #f8ec59;">for</span> n <span style="color: #f8ec59;">in</span> numbers <span style="color: #f8ec59;">if</span> n % 2 == 0]
<span style="color: #fcfbe3;">print</span>(squares) <span style="color: #d55e00; font-style: italic;"># </span><span style="color: #d55e00; font-style: italic;">Output: [4, 16]</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2d0aa7c" class="outline-2">
<h2 id="org2d0aa7c"><span class="section-number-2">4.</span> 🛒 Shopping &amp; Errands</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Buy Almond Milk</li>
<li class="off"><code>[&#xa0;]</code> Pick up dry cleaning</li>
<li class="off"><code>[&#xa0;]</code> Order new mechanical keyboard switches</li>
</ul>
</div>
</div>
<div id="outline-container-orgad3e93f" class="outline-2">
<h2 id="orgad3e93f"><span class="section-number-2">5.</span> 🗓️ Calendar &amp; Deadlines</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>TODO Submit Tax Returns                      |<span class="timestamp-wrapper"><span class="timestamp">&lt;2024-04-15 Mon&gt;</span></span></li>
<li>TODO Dentist Appointment                     |<span class="timestamp-wrapper"><span class="timestamp">&lt;2024-05-25 Sat&gt;</span></span></li>
<li>TODO Renew Passport                          |<span class="timestamp-wrapper"><span class="timestamp">&lt;2024-07-10 Wed&gt;</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-org1ceca35" class="outline-2">
<h2 id="org1ceca35"><span class="section-number-2">6.</span> 📥 Inbox / Scratchpad</h2>
<div class="outline-text-2" id="text-6">
<p>
(Quickly dump thoughts here and organize them later using <code>C-c C-w</code> or <code>M-x org-refile</code>)
</p>
<ul class="org-ul">
<li>Idea: Start a podcast about productivity.</li>
<li>Remember to call Mom on Sunday.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-05-20 Mon 00:00</p>
<p class="author">Author: Your Name</p>
<p class="date">Created: 2026-04-09 Thu 16:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
